In [1]:
import numpy as np
import pandas as pd

In [2]:
## Series In Pandas

In [3]:
label = ['a','b','c']
arr=np.array([1,2,3])
my_list = [3,'a',5]
my_dict = {1:10,2:20,3:30}

In [4]:
pd.Series([100,200,300])

0    100
1    200
2    300
dtype: int64

In [5]:
pd.Series(arr,label)

a    1
b    2
c    3
dtype: int64

In [6]:
pd.Series(arr,my_list)

3    1
a    2
5    3
dtype: int64

In [7]:
pd.Series(my_list,label)

a    3
b    a
c    5
dtype: object

In [8]:
pd.Series(my_dict)

1    10
2    20
3    30
dtype: int64

In [9]:
## Data Frames in Pandas

In [10]:
## ---> this is how we can create the Data Frames in the Pandas

In [11]:
data={
    "name":["Arpit","Aman","Gouri","Sia"],
    "Age":[19,17,15,12],
    "Score":[95,85,75,100]
}

In [12]:
pd.DataFrame(data)

    name  Age  Score
0  Arpit   19     95
1   Aman   17     85
2  Gouri   15     75
3    Sia   12    100

In [13]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
pd.DataFrame(data_list)

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [14]:
col = ["Name","Age","Location","Salary"]
df=pd.DataFrame(data_list,columns=col)
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [15]:
##---->How to Select a paticular col from the dataframe

In [16]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [17]:
df[["Name","Location"]]

    Name  Location
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [18]:
## ---> Creating a new col

In [19]:
df["Role"] = ["Doc","Eng","teacher","Doc"]

In [20]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [21]:
few_info=df[["Name","Salary","Role"]]

In [22]:
few_info

    Name  Salary     Role
0   John   65000      Doc
1   Anna   70000      Eng
2  Peter   62000  teacher
3  Linda   85000      Doc

In [23]:
## Deleting col

In [24]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [25]:
df.drop("Role",axis=1)

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [26]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [27]:
## So to remove the Role from the memory we can use the inplace

In [28]:
df.drop("Role",axis=1,inplace=True)

In [29]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [30]:
## Deleting the row

In [31]:
df.drop(2,axis=0)

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
3  Linda   42    London   85000

In [32]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [33]:
## we can use inplace to delete it from the memory

In [34]:
## axis =0 is used for "X" means row 
## axis = 1 is used for "Y" means col

In [35]:
# For selecting the row

In [36]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [37]:
df.loc[0]

Name            John
Age               28
Location    New York
Salary         65000
Name: 0, dtype: object

In [38]:
df.loc[[0,1]]

   Name  Age  Location  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [39]:
df[["Name","Salary"]]   #for coloumn

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

In [40]:
## how to select the subset of of both row and col

In [41]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [42]:
## for example i want 0,1 row location and Salary which is New York 65000  and paris 70000

In [43]:
df.loc[[0,1]][["Location","Salary"]]

   Location  Salary
0  New York   65000
1     Paris   70000

In [44]:
## Conditional Statement

In [45]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [46]:
# I want people  whoes age is above 30

In [47]:
df[df["Age"]>30]

    Name  Age Location  Salary
1   Anna   34    Paris   70000
3  Linda   42   London   85000

In [48]:
# I want people  whoes age is above 30 and location Paris

In [49]:
df[(df["Age"]>30) & (df["Location"]=="Paris")]

   Name  Age Location  Salary
1  Anna   34    Paris   70000

In [50]:
## Finding the missing data

In [51]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)

In [52]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [53]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [54]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [55]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

In [56]:
## Removing the null data

In [57]:
# we can drop the row of null values

In [58]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [59]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [60]:
df.dropna(thresh=3) # thresh means atleast kitna not null value hona chaihiye ek row mein

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [61]:
## fill the null field

In [62]:
df.fillna(0 )

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [63]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [64]:
## you can see my dataset is same from starting because i didn't used the inplace=True

In [65]:
value = {"A":200,"B":100,"C":-5,"D":500}

In [66]:
df.fillna(value=value)

       A  B    C      D
0    1.0  1  1.0    1.0
1    2.0  2  2.0  500.0
2  200.0  3  3.0  500.0
3    4.0  4 -5.0  500.0
4    5.0  5 -5.0    5.0

In [67]:
## Merging two dataframes

In [68]:
d1={
    "Name":["Arpit","Aman","Abhi"],
    "Role":["Full Stack","AI/ML","Frontend"],
    "salary":[1000,500,100]
}
d2={
    "Name":["Arpit","Aman","Abhi"],
    "loc":["UP","JK","Bihar"],
    "Age":[19,20,22]
}

In [69]:
d1

{'Name': ['Arpit', 'Aman', 'Abhi'],
 'Role': ['Full Stack', 'AI/ML', 'Frontend'],
 'salary': [1000, 500, 100]}

In [70]:
d2

{'Name': ['Arpit', 'Aman', 'Abhi'],
 'loc': ['UP', 'JK', 'Bihar'],
 'Age': [19, 20, 22]}

In [72]:
#so i have  the data so first make 2 dataframes

In [74]:
dataframes1= pd.DataFrame(d1)
dataframes1

    Name        Role  salary
0  Arpit  Full Stack    1000
1   Aman       AI/ML     500
2   Abhi    Frontend     100

In [75]:
dataframes2= pd.DataFrame(d2)
dataframes2

    Name    loc  Age
0  Arpit     UP   19
1   Aman     JK   20
2   Abhi  Bihar   22

In [78]:
dataframes1["Name"]

0    Arpit
1     Aman
2     Abhi
Name: Name, dtype: object

In [80]:
merged1d2=pd.merge(dataframes1,dataframes2)
merged1d2

    Name        Role  salary    loc  Age
0  Arpit  Full Stack    1000     UP   19
1   Aman       AI/ML     500     JK   20
2   Abhi    Frontend     100  Bihar   22

In [81]:
##concatination

In [82]:
dataframes1

    Name        Role  salary
0  Arpit  Full Stack    1000
1   Aman       AI/ML     500
2   Abhi    Frontend     100

In [83]:
dataframes2

    Name    loc  Age
0  Arpit     UP   19
1   Aman     JK   20
2   Abhi  Bihar   22

In [84]:
pd.concat([dataframes1,dataframes2]) ## dedault axis = 0 which means col wise

    Name        Role  salary    loc   Age
0  Arpit  Full Stack  1000.0    NaN   NaN
1   Aman       AI/ML   500.0    NaN   NaN
2   Abhi    Frontend   100.0    NaN   NaN
0  Arpit         NaN     NaN     UP  19.0
1   Aman         NaN     NaN     JK  20.0
2   Abhi         NaN     NaN  Bihar  22.0

In [87]:
pd.concat([dataframes1,dataframes2] , axis=1 ) ## axis = 1 which means row wise

    Name        Role  salary   Name    loc  Age
0  Arpit  Full Stack    1000  Arpit     UP   19
1   Aman       AI/ML     500   Aman     JK   20
2   Abhi    Frontend     100   Abhi  Bihar   22

In [88]:
## GroupBy

In [90]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
gb_dataf = pd.DataFrame(data)
gb_dataf

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [92]:
cat=gb_dataf.groupby("Category")
cat

In [95]:
for i in cat :
    print(i)

('A',   Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
2        A    S2    150        12 2023-01-03
4        A    S1    120         8 2023-01-05
6        A    S2    200        15 2023-01-07)
('B',   Category Store  Sales  Quantity       Date
1        B    S1    200        15 2023-01-02
3        B    S2    250        18 2023-01-04
5        B    S2    180        20 2023-01-06
7        B    S1    300        25 2023-01-08)

In [96]:
#so to find the sum of Category A and Category B

In [98]:
gb_dataf.groupby("Category")["Sales"].sum()

Category
A    570
B    930
Name: Sales, dtype: int64

In [99]:
## Aggregation

In [101]:
gb_dataf["Sales"].mean()

np.float64(187.5)

In [102]:
gb_dataf["Sales"].max()

np.int64(300)

In [103]:
gb_dataf["Sales"].min()

np.int64(100)

In [104]:
gb_dataf['Sales'].agg(['sum', 'mean', 'min', 'max', 'count', 'std', 'median'])

sum       1500.000000
mean       187.500000
min        100.000000
max        300.000000
count        8.000000
std         66.062741
median     190.000000
Name: Sales, dtype: float64

In [105]:
# Pivot Tables

In [106]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    256     40   John  January      Q1
1  2023-01-02       B   West    382     39   Mary  January      Q1
2  2023-01-03       C  North    425     28    Bob  January      Q1
3  2023-01-04       D  South    335     35  Alice  January      Q1
4  2023-01-05       A   East    169     18   John  January      Q1
5  2023-01-06       B   West    696     42   Mary  January      Q1
6  2023-01-07       C  North    842     49    Bob  January      Q1
7  2023-01-08       D  South    738     28  Alice  January      Q1
8  2023-01-09       A   East    702     79   John  January      Q1
9  2023-01-10       B   West    924     34   Mary  January      Q1
10 2023-01-11       C  North    326     64    Bob  January      Q1
11 2023-01-12       D  South    156     59  Alice  January      Q1
12 2023-01-13       A   East    884     54   John  January      Q1
13 2023-01-14       B   West    489     91   Mary  January      Q1
14 2023-01-15       C  North    802     92    Bob  January      Q1
15 2023-01-16       D  South    424     57  Alice  January      Q1
16 2023-01-17       A   East    236     82   John  January      Q1
17 2023-01-18       B   West    179     86   Mary  January      Q1
18 2023-01-19       C  North    378     91    Bob  January      Q1
19 2023-01-20       D  South    975     47  Alice  January      Q1

In [107]:
pd.pivot_table(df,values = "Sales",index = 'Region',columns="Product",aggfunc = 'median')

Product      A      B      C      D
Region
East     256.0    NaN    NaN    NaN
North      NaN    NaN  425.0    NaN
South      NaN    NaN    NaN  424.0
West       NaN  489.0    NaN    NaN

In [108]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     449.4    NaN    NaN    NaN  54.6   NaN   NaN   NaN
North      NaN    NaN  554.6    NaN   NaN   NaN  64.8   NaN
South      NaN    NaN    NaN  525.6   NaN   NaN   NaN  45.2
West       NaN  534.0    NaN    NaN   NaN  58.4   NaN   NaN

In [109]:
## Operations

In [110]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [111]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [114]:
df1.shape # --> 5 row and 3 col

(5, 3)

In [115]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [117]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [119]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [120]:
#DataFrames Applying Functions

In [121]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [122]:
def square(x):
    return x**2

In [124]:
df1["B"].apply(square)

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64

In [125]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [126]:
df1["B"]=df1["B"].apply(square)

In [127]:
df1

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500

In [129]:
## we can also create a new col and save the operation data

In [134]:
df1["Square of C "] = df1["C"].apply(square)

In [135]:
df1

   A     B    C  Square of C
0  1   100  100         10000
1  2   400  200         40000
2  3   900  300         90000
3  4  1600  400        160000
4  5  2500  500        250000